delete from measurment_input_params where id > 15;
delete from measurment_baths where id > 3;

-- 1. Пачки измерений
insert into measurment_baths(id, emploee_id, measurment_type_id, started) 
values
(4, 1, 1, '2026-08-04 10:00:00'),
(5, 1, 1, '2026-08-08 16:00:00'),
(6, 2, 1, '2026-08-17 08:45:00'),
(7, 2, 1, '2026-08-21 12:15:00'),
(8, 3, 1, '2026-08-24 13:30:00'),
(9, 3, 1, '2026-08-26 12:30:00');

insert into measurment_baths(id, emploee_id, measurment_type_id, started) 
values
(10, 1, 2, '2026-08-11 08:30:00'),
(11, 2, 2, '2026-08-20 07:45:00'),
(12, 3, 2, '2026-08-28 13:00:00');



-- 5 пачек (ДМК)
insert into measurment_input_params(id, measurment_bath_id, parameter_type_id, value) 
values
-- пачка 4
(16, 4, 1, 103),
(17, 4, 2, 11.6),
(18, 4, 3, 757),
(19, 4, 4, 18),
(20, 4, 5, 4),
-- пачка 5
(21, 5, 1, 118),
(22, 5, 2, 12.5),
(23, 5, 3, 760),
(24, 5, 4, 45),
(25, 5, 5, 11),
-- пачка 6
(26, 6, 1, 133),
(27, 6, 2, 15.6),
(28, 6, 3, 767),
(29, 6, 4, 45),
(30, 6, 5, 5),
-- пачка 7
(31, 7, 1, 106),
(32, 7, 2, 18.3),
(33, 7, 3, 742),
(34, 7, 4, 25),
(35, 7, 5, 9),
-- пачка 8
(36, 8, 1, 130),
(37, 8, 2, 19),
(38, 8, 3, 743),
(39, 8, 4, 27),
(40, 8, 5, 8),
-- пачка 9
(41, 9, 1, 136),
(42, 9, 2, 25.8),
(43, 9, 3, 752),
(44, 9, 4, 58),
(45, 9, 5, 8);
 
-- 5 пачек (ВР)
insert into measurment_input_params(id, measurment_bath_id, parameter_type_id, value) 
values
-- пачка 10
(46, 10, 1, 93),
(47, 10, 2, 25.2),
(48, 10, 3, 758),
(49, 10, 4, 59),
(50, 10, 6, 71),
-- пачка 11
(51, 11, 1, 125),
(52, 11, 2, 19.3),
(53, 11, 3, 740),
(54, 11, 4, 36),
(55, 11, 6, 38),
-- пачка 12
(56, 12, 1, 76),
(57, 12, 2, 24.7),
(58, 12, 3, 770),
(59, 12, 4, 45),
(60, 12, 6, 76);

